InformationRegisters/Renault_РабочиеЛисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_РабочиеЛисты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>VINАвтомобилей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаID</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапросНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛистЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаркаАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МодельАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтересМодель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныЗакрытияРЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_НаборЦветов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторЗакрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖелаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапросаНаЗакрытие</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРабочегоЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыРабочихЛистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязаныйIDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажаБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтомобильБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПродажиВыкупа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гарантия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокГарантии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАвтомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDCRM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_Трафик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_Трафик</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПервичныйИнтерес</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПервичныйИнтерес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипАктивности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_ТипыАктивностиТрафика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Закрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_РабочийЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипТрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ТипТрафика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПервичныйПовторный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ПервичныйПовторный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ЗначенияРеквизитовТрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ЗначенияРеквизитовТрафика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CRM_РеквизитыТрафика</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТрафика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеквизитТрафика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_РеквизитыТрафика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СведенияКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СведенияКомпании</Name>
			<Comment>Некоторые сведения о компании которые могут измениться со временем (например гл. бухгалтер, руководитель...)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение сведения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:EnumRef.СтратегияСписанияПартийТоваровПоСтатусам</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:EnumRef.СтратегияСписанияПартийТоваровПоДатам</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Вид сведения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовСведений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
			<Comment>Виды контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Основное взаимодействие с контрагентом - продажа, передача на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Основное взаимодействие с контрагентом - закупка и принятие на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Comment>Подотчетное лицо компании</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Филиал компании, одна из организаций</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственник</Name>
					<Comment>Собственник компании, осуществляющий финансирование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Контактное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие контрагенты</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/Renault_КонтактЦентр_Сервер/Ext/Module.bsl
Функция ПроверитьПравоПользователя(Право, Пользователь) Экспорт
	Возврат Renault_РаботаСПравамиПользователя.ЕстьПравоНаПодтверждениеДокументаТестДрайв(Пользователь);	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ПраваИНастройки.Значение
	//			   |ИЗ
	//			   |	РегистрСведений.ПраваИНастройки КАК ПраваИНастройки
	//			   |ГДЕ
	//			   |	ПраваИНастройки.Объект.Ссылка = &Пользователь
	//			   |	И ПраваИНастройки.ПравоНастройка.Ссылка = &Право";
	//Запрос.УстановитьПараметр("Право", Право);
	//Запрос.УстановитьПараметр("Пользователь", Пользователь);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Возврат Выборка.Значение;
	//Иначе
	//	Возврат Ложь;
	//КонецЕсли;  				   
	
КонецФункции

////@+ Функция СоздатьПотенциальногоКонтрагентаПоРабочемуЛисту(РабочийЛист, ДатаСоздания)
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Функция ТипФункции="Экспорт"
//         ИнструкцииПрепроцессору=""
//         ДатаCоздания="23.04.2013 9:46:10" Автор="Администратор информационной базы">
// <Имя>СоздатьПотенциальногоКонтрагентаПоРабочемуЛисту(РабочийЛист)</Имя>
//
// <Описание>
//  Автоматически создает потенциального клиента. Если это возможно.
// </Описание>
//
// <Параметры>
//  <Параметр>
//  <ИмяПараметра>РабочийЛист</ИмяПараметра>
//  	<ТипПараметра>Число(10,0)</ТипПараметра>
//  	<ОписаниеПараметра>Номер рабочего листа, из которого тянем ФИО и телефон.</ОписаниеПараметра>
//  </Параметр>
//  <Параметр>
//  <ИмяПараметра>ДатаСоздания</ИмяПараметра>
//  	<ТипПараметра>ДатаВремя</ТипПараметра>
//  	<ОписаниеПараметра>Дата документа, на которую нужно найти данные по Рабочему листу.</ОписаниеПараметра>
//  </Параметр>
// </Параметры>
//  <Результат>
//  	<ИмяРезультата>СсылкаНаПотенциальногоКонтрагента</ИмяРезультата>
//  	<ТипРезультата>СправочникСсылка.CRM_ПотенциальныеКонтрагенты</ТипРезультата>
//  	<ОписаниеРезультата>Ссылка на созданного контрагента или пустая ссылка, если создание клиента не удалось.
//  	</ОписаниеРезультата>
//  </Результат>
//</Функция>
//</Автодок>
//</xml>
//@-
Функция СоздатьПотенциальногоКонтрагентаПоРабочемуЛисту(Знач РабочийЛист, Знач ДатаСоздания) Экспорт
	
	//Функция более не используется
	
	//Первоначальная инициализация
	СсылкаНаПотенциальногоКонтрагента = Справочники.CRM_ПотенциальныеКонтрагенты.ПустаяСсылка();
	
	// Комментарий 
	//Дата создания - 23.04.2013 9:51:29; Автор - Администратор информационной базы
	//
	//Для начала получим данные из рабочего листа.
	//
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Renault_РабочиеЛисты.Удалить_ФИО,
	|	Renault_РабочиеЛисты.Клиент,
	|	Renault_РабочиеЛисты.Удалить_Телефон,
	|	Renault_РабочиеЛисты.Удалить_Email
	|ИЗ
	|	РегистрСведений.Renault_РабочиеЛисты КАК Renault_РабочиеЛисты
	|ГДЕ
	|	Renault_РабочиеЛисты.IDK = &ИДК"
	);
	Запрос.УстановитьПараметр("ИДК", Число(РабочийЛист));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() тогда
		
		// Комментарий 
		//Дата создания - 23.04.2013 10:28:35; Автор - Администратор информационной базы
		//
		// Блок проверок заполненности данных
		//
		Если ЗначениеЗаполнено(Выборка.Клиент) тогда
			Возврат Выборка.Клиент;
		КонецЕсли;
		
		ФИО = СокрЛП(Выборка.ФИО);
		Если НЕ ЗначениеЗаполнено(ФИО) тогда 
			ФИО = "Потенциальный клиент по РЛ №" + Строка(РабочийЛист);
		КонецЕсли;
		ФИОСтарое = ФИО;
		
		//Нужно разделить ФИО на отдельные поля. Это нужно для поиска.
		// Комментарий 
		//Дата создания - 23.04.2013 10:40:07; Автор - Администратор информационной базы
		//
		// Все проверки прошли, начинаем создание
		//
		
		Фамилия = "";
		Имя = "";
		Отчество = "";
		
		Если НЕ СтрДлина(ФИО) = 0 тогда
			ПозицияПробела = Найти(ФИО, " ");
		Иначе
			ПозицияПробела = 0;
		КонецЕсли;
		Если НЕ ПозицияПробела = 0 Тогда
			
			Фамилия = СокрЛП(Лев(ФИО, ПозицияПробела));
			ФИО = СокрЛП(СтрЗаменить(ФИО, Фамилия, ""));
			
		КонецЕсли;
		
		Если НЕ СтрДлина(ФИО) = 0 тогда
			ПозицияПробела = Найти(ФИО, " ");
		Иначе
			ПозицияПробела = 0;
		КонецЕсли;
		Если НЕ ПозицияПробела = 0 Тогда
			
			Имя = СокрЛП(Лев(ФИО, ПозицияПробела));
			ФИО = СокрЛП(СтрЗаменить(ФИО, Имя, ""));
			
		КонецЕсли;
		
		Если НЕ СтрДлина(ФИО) = 0 тогда
			ПозицияПробела = Найти(ФИО, " ");
		Иначе
			ПозицияПробела = 0;
		КонецЕсли;
		Если НЕ ПозицияПробела = 0 Тогда
			
			Отчество = СокрЛП(Лев(ФИО, ПозицияПробела));
			ФИО = СокрЛП(СтрЗаменить(ФИО, Отчество, ""));
			
		КонецЕсли;
		
		//Проверим Заполненность фамилии, если пустая, значит пробелов не нашли - 
		// копируем все ФИО
		
		Фамилия = ?(ЗначениеЗаполнено(Фамилия), Фамилия, ФИО);
		
		НачатьТранзакцию();
		
		ПотенциальныйКонтрагентОбъект = Справочники.CRM_ПотенциальныеКонтрагенты.СоздатьЭлемент();
		
		ФИО = Фамилия + " " + Имя + " " + Отчество;
		ПотенциальныйКонтрагентОбъект.Наименование	 = СокрЛП(ФИО);
		ПотенциальныйКонтрагентОбъект.Наименование	 = ФИОСтарое;
		
		ПотенциальныйКонтрагентОбъект.Фамилия		 = Фамилия;
		ПотенциальныйКонтрагентОбъект.Имя			 = Имя;
		ПотенциальныйКонтрагентОбъект.Отчество		 = Отчество;
		ПотенциальныйКонтрагентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
		ПотенциальныйКонтрагентОбъект.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
		
		ПотенциальныйКонтрагентОбъект.Записать();
		
		СсылкаНаПотенциальногоКонтрагента = ПотенциальныйКонтрагентОбъект.Ссылка;
		
		//Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		//Менеджер.Объект = СсылкаНаПотенциальногоКонтрагента;
		//Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		//Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
		//Если ЗначениеЗаполнено(Выборка.Телефон) Тогда
		//	Менеджер.Представление = Выборка.Телефон;
		//	Менеджер.Записать(Истина);
		//Иначе
		//	Менеджер.Удалить();
		//КонецЕсли;
		//
		//Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		//Менеджер.Объект = СсылкаНаПотенциальногоКонтрагента;
		//Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		//Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний;
		//Если ЗначениеЗаполнено(Выборка.Email) Тогда
		//	Менеджер.Представление = Выборка.Email;
		//	Менеджер.Записать(Истина);
		//Иначе
		//	Менеджер.Удалить();
		//КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
	Возврат СсылкаНаПотенциальногоКонтрагента;
	
КонецФункции // СоздатьПотенциальногоКонтрагентаПоРабочемуЛисту(РабочийЛист, ДатаСоздания)

Функция СоздатьПотенциальногоКонтрагентаПоТрафику(Знач ТрафикID) Экспорт
	
	СсылкаНаПотенциальногоКонтрагента = Справочники.CRM_ПотенциальныеКонтрагенты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_Трафик.Клиент,
	               |	Renault_Трафик.Представление,
	               |	Renault_Трафик.ПервичныйИнтерес,
	               |	Renault_Трафик.ИсточникИнформации,
	               |	Renault_Трафик.ТипТрафика
	               |ИЗ
	               |	РегистрСведений.Renault_Трафик КАК Renault_Трафик
	               |ГДЕ
	               |	Renault_Трафик.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор", ТрафикID);
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		
		Если ЗначениеЗаполнено(Выборка.Клиент) тогда
			Возврат Выборка.Клиент;
		КонецЕсли;
		
		//Получим реквизиты трафика
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CRM_ЗначенияРеквизитовТрафика.РеквизитТрафика,
		               |	CRM_ЗначенияРеквизитовТрафика.ЗначениеРеквизита
		               |ИЗ
		               |	РегистрСведений.CRM_ЗначенияРеквизитовТрафика КАК CRM_ЗначенияРеквизитовТрафика
		               |ГДЕ
		               |	CRM_ЗначенияРеквизитовТрафика.ИдентификаторТрафика = &ИдентификаторТрафика";
		Запрос.УстановитьПараметр("ИдентификаторТрафика", ТрафикID);
		ТаблицаРеквизитов = Запрос.Выполнить().Выгрузить();
		
		СтрокаПол = ТаблицаРеквизитов.Найти(ПланыВидовХарактеристик.CRM_РеквизитыТрафика.Пол);
		Если СтрокаПол = Неопределено Тогда
			Пол = Неопределено;
		Иначе
			Пол = СтрокаПол.ЗначениеРеквизита;
		КонецЕсли;
		
		СтрокаТелефон = ТаблицаРеквизитов.Найти(ПланыВидовХарактеристик.CRM_РеквизитыТрафика.Телефон);
		Если СтрокаТелефон = Неопределено Тогда
			Телефон = Неопределено;
		Иначе
			Телефон = СтрокаТелефон.ЗначениеРеквизита;
		КонецЕсли;
		
		КлиентОбъект = Справочники.CRM_ПотенциальныеКонтрагенты.СоздатьЭлемент();
		
		ФИО = СокрЛП(Выборка.Представление);
		Если Не ЗначениеЗаполнено(ФИО) Тогда
			ФИО = "Не заполнено";
		Иначе
			//Попробуем разбить на Фамилию - Имя - Отчество
			Фамилия = "";
			Имя = "";
			Отчество = "";
			РазбитьФИО(ФИО, Фамилия, Имя, Отчество);			
		КонецЕсли;
		
		КлиентОбъект.Наименование = ФИО;
		КлиентОбъект.НаименованиеПолное = ФИО;
		КлиентОбъект.Фамилия = Фамилия;
		КлиентОбъект.Имя = Имя;
		КлиентОбъект.Отчество = Отчество;
		КлиентОбъект.Пол = Пол;
		КлиентОбъект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
		КлиентОбъект.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
		
		КлиентОбъект.Записать();
		
		//Телефон
		Если ЗначениеЗаполнено(Телефон) Тогда
			//Запись = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			//Запись.Объект = КлиентОбъект.Ссылка;
			//Запись.ЗначениеПоУмолчанию = Истина;
			//Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			//Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
			//Запись.Представление = Телефон;
			//Запись.Записать(Истина);
			Renault_УправлениеКонтактнойИнформацией.ЗаписатьОсновнойТелефонКлиента(Телефон, КлиентОбъект.Ссылка);
		КонецЕсли;
		
		//Прочие клиентские данные
		ЗаписьКлиентскиеДанные = РегистрыСведений.CRM_КлиентскиеДанные.СоздатьМенеджерЗаписи();
		ЗаписьКлиентскиеДанные.Клиент = КлиентОбъект.Ссылка;
		ЗаписьКлиентскиеДанные.ДатаСоздания = ТекущаяДата();
		ЗаписьКлиентскиеДанные.ИсточникИнформации = Выборка.ИсточникИнформации;
		ЗаписьКлиентскиеДанные.Записать();
		
		Возврат КлиентОбъект.Ссылка;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьРуководителяОтделаПродаж(Организация) Экспорт
	
	СтруктураОтбора = Новый Структура("Организация,Объект", Организация, Перечисления.ВидыОбъектовСведений.Руководитель);
	СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее( , СтруктураОтбора);
	Возврат СтруктураСведений.Значение;
	
КонецФункции

Функция ПолучитьДокумент(Клиент, Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Клиент);
	Запрос.УстановитьПараметр("ВидДокумента", Документ);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодтверждающиеДокументы.Ссылка
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Владелец
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &ВидДокумента
	|	И ПодтверждающиеДокументы.Текущий";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.ПодтверждающиеДокументы.ПустаяСсылка();
		
КонецФункции

Функция ПолучитьОписаниеДокумента(Клиент, Документ) Экспорт
	
	ДокСсылка = ПолучитьДокумент(Клиент, Документ);
	Если ЗначениеЗаполнено(ДокСсылка) Тогда
		Док = ДокСсылка.ПолучитьОбъект();
		СтрокаВыдачи = "";
		Если ЗначениеЗаполнено(Док.ДатаВыдачи) Тогда
			Если Документ = Перечисления.ВидыДокументов.Доверенность
						ИЛИ Документ = Перечисления.ВидыДокументов.Лицензия 
						ИЛИ Документ = Перечисления.ВидыДокументов.Справка Тогда
				СтрокаВыдачи = " выдана " + Формат(Док.ДатаВыдачи,"ДФ=dd.MM.yy")
			ИначеЕсли Документ = Перечисления.ВидыДокументов.Удостоверение 
						ИЛИ Документ = Перечисления.ВидыДокументов.Свидетельство Тогда
				СтрокаВыдачи = " выдано " + Формат(Док.ДатаВыдачи,"ДФ=dd.MM.yy")
			Иначе	
				СтрокаВыдачи = " выдан " + Формат(Док.ДатаВыдачи,"ДФ=dd.MM.yy") + ?(ПустаяСтрока(Док.КемВыдан),""," " + Док.КемВыдан)
			КонецЕсли;
		КонецЕсли;
		Возврат СокрЛП(Док.Серия)+" № "+СокрЛП(Док.Номер) + СтрокаВыдачи;
	Иначе
		Возврат ""
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьМаркуRenault() Экспорт
	
	Возврат Справочники.CRM_МаркаАвтомобиля.Renault;
	
КонецФункции

Процедура РазбитьФИО(Знач ФИО, Фамилия, Имя, Отчество) Экспорт
	
	ФИО = СокрЛП(ФИО);
	Если СтрДлина(ФИО) = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//Фамилия
	ПозицияПробела = Найти(ФИО, " ");
	Фамилия = СокрЛП(Лев(ФИО, ПозицияПробела));
	ФИО = СокрЛП(Сред(ФИО, ПозицияПробела));
	
	//Имя, Отчество
	ПозицияПробела = Найти(ФИО, " ");
	Имя = СокрЛП(Лев(ФИО, ПозицияПробела));
	Отчество = СокрЛП(Сред(ФИО, ПозицияПробела));
	
КонецПроцедуры

Функция Renault_CRM_СкорректироватьТелефонПриЗаписи(Телефон) Экспорт
	
	РазрешенныеСимволы = "0123456789";
	
	рСтрока = "";
	Для Номер=1 по СтрДлина(Телефон) Цикл
		нСимвол = Сред(СокрЛП(Телефон), Номер,1);
		Если Найти(РазрешенныеСимволы, нСимвол) <> 0 Тогда
			рСтрока = рСтрока + нСимвол;
		КонецЕсли;			
	КонецЦикла;
	
	Возврат рСтрока;
	
КонецФункции

// Функция "расщепляет" строку на подстроки, используя заданный 
//		разделитель. Разделитель может иметь любую длину. 
//		Если в качестве разделителя задан пробел, рядом стоящие пробелы 
//		считаются одним разделителем, а ведущие и хвостовые пробелы параметра Стр
//		игнорируются.
//		Например, 
//		РазложитьСтрокуВМассивПодстрок(",ку,,,му", ",") возвратит массив значений из пяти элементов, 
//		три из которых - пустые строки, а 
//		РазложитьСтрокуВМассивПодстрок(" ку   му", " ") возвратит массив значений из двух элементов
//
//	Параметры: 
//		Стр - 			строка, которую необходимо разложить на подстроки. 
//						Параметр передается по значению.
//		Разделитель - 	строка-разделитель, по умолчанию - запятая.
//
//
//	Возвращаемое значение:
//		массив значений, элементы которого - подстроки
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции // глРазложить

Функция НайтиСоздатьХозОперацию(ИмяОперации) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ХозОперации.Ссылка
	                      |ИЗ
	                      |	Справочник.ХозОперации КАК ХозОперации
	                      |ГДЕ
	                      |	ХозОперации.Наименование = &Имя");
	Запрос.УстановитьПараметр("Имя",ИмяОперации);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Ссылка;
	Иначе
		//Попытка
		//	ВыбОбъект = Справочники.ХозОперации.СоздатьЭлемент();
		//	ВыбОбъект.УстановитьНовыйКод();
		//	ВыбОбъект.Наименование = ИмяОперации;
		//	ВыбОбъект.Записать();
		//	Возврат ВыбОбъект.Ссылка;
		//Исключение
		Возврат Справочники.ХозОперации.ПрочиеДокументы; 
		
		
	КонецЕсли;
	
	
КонецФункции
